<?php
include 'funct.php';

$id = $_GET['id'];
$mode = $_GET['mode'];

$shinagawa=array("28494","51870","5925","108390","69219");

$odaiba=array("69354","1917","8492","84927","76373");

$hakodate=array("109487","5145","72067","69295","107743","20153","1341","70859","10940","28667","11076","84745","56773","67958",
"11251","5533","2048","67319","8241","5393","1639","9262","18146","20061","5000","38700","68526","4932","76773","68596");

$jiyugaoka=array("74720");

$tokushima=array("7980","8723","84972","7503","4721","8864","108376","56911","357","79371","74531","28052","29238","14303",
"49394","69229","9417","532","15151","19105","29720","8722","17801","10873","76408","29935","8830","8493","9403","68537",);

$kyoto=array("68231","9197","7351","8817","4794","7843","41137",);

$kagoshima=array("80819","5312","39298","8940","50538","49364","44873","5682","25271","8912","916","538","41595","8563","442",
"108378","74756","39296","17649","8621","37850","16616","50815","1642","41598","68208","1527",);

$place = "";

$result="[";

if(in_array($id, $shinagawa)){
	$lat = array("35.609947","35.607675","35.609733","35.610963");
	$lng = array("139.748079","139.750058","139.748288","139.749076");
	$result.=genJSON($lat, $lng, "【本店】");
	//$place="shinagawa";
	
}else if(in_array($id, $odaiba)){
	$lat = array("35.624809","35.626448","35.62582","35.620588");
	$lng = array("139.778945","139.773796","139.772851","139.775319");
	$result.=genJSON($lat, $lng, "【お台場店】");
	//$place="odaiba";
}else if(in_array($id, $jiyugaoka)){
	$lat = array("35.607884","35.607941","35.607252","35.609648");
	$lng = array("139.667875","139.669967","139.669538","139.667604");
	$result.=genJSON($lat, $lng, "【自由が丘店】");
	//$place="jiyugaoka";
}else if(in_array($id, $hakodate)){
	$lat = array("41.764742","41.762973","41.762429","41.766575");
	$lng = array("140.718405","140.721066","140.71671","140.717762");
	$result.=genJSON($lat, $lng, "【函館店】");
	//$place="hakodate";
}else if(in_array($id, $tokushima)){
	$lat = array("34.077208","34.076497","34.074933","34.079411");
	$lng = array("134.557414","134.562671","134.557564","134.560461");
	$result.=genJSON($lat, $lng, "【徳島店】");
	//$place="tokushima";
}else if(in_array($id, $kyoto)){
	$lat = array("35.022072","35.02042","35.018293","35.021667");
	$lng = array("135.775716","135.778849","135.777969","135.781231");
	$result.=genJSON($lat, $lng, "【京都店】");
	//$place="kyoto";
}else if(in_array($id, $kagoshima)){
	$lat = array("31.583242","31.584266","31.585299","31.582466");
	$lng = array("130.54425","130.544872","130.544829","130.543842");
	$result.=genJSON($lat, $lng, "【鹿児島店】");
	//$place="kagoshima";
}

$result = substr($result,0,-1);
$result.="]";
	
echo $result;
 
function genJSON($glat,$glng,$msg){
	$restaurants = array("楽天屋A","楽天屋B","楽天屋B","プラッチ屋");
	$categories = array("居酒屋","和食","洋食","タイ料理");
	$budgets = array("2000","3000","4000","2500");
	$coupons1 = array("１）飲み放題90分1000円","１）生ビールサービス","１）サイドメニュ500円⇒300円","１）お通しサービス");
	$coupons2 = array("２）月曜日10％オフ","２）食後お茶サービス","２）デザートサービス","２）水曜日10％オフ");
	
	
	for ($i = 0; $i < sizeof($restaurants); $i++) {
		$json.=("{");
		$json.=("\""."name"."\":\"".$restaurants[$i]."【本店】"."\",");
		$json.=("\""."category"."\":\"".$categories[$i]."\",");
		$json.=("\""."budget"."\":\"".$budgets[$i]."\",");
		$json.=("\""."latitude"."\":\"".$glat[$i]."\",");
		$json.=("\""."longitude"."\":\"".$glng[$i]."\",");
		$json.=("\""."coupon"."\":[");
		$json.="\"".$coupons1[$i]."\",";
		$json.="\"".$coupons2[$i]."\"]";
		$json.=("}");
		$json.=(",");
	}
	
	
	return $json;
}
?>